<script setup lang="ts">
import { ref, inject, computed, watch } from 'vue'
</script>
<template>
    <div class="flex w-full justify-center min-h-100dvh font-noto bg-beige_mist">
        <div class="container">

            【 關於我 】

            -喜歡思考、分析問題後找出解決的方法，專注將一件事盡所能做到好，是個決定好目標和方向就會充滿動力的人

            -遇到問題會先尋找解決方法，抱持能解決的問題就不是問題的態度，也意外學習到其他資源與技術

            -喜歡團體合作與討論程式的氣氛，樂於與同事、同好朋友分享所知所學的程式設計以及架構概念



            【從無到有、 敏捷開發，校務系統驗收前兩個月加入開發小組】

            快速開發的環境下，密切地與 UI/UX 設計師及 主管 確認規格，和
            後端開發人員討論訂定參數格式與遇到狀況時的溝通方式，也與測試人員確認錯誤重現步驟修復回報，與主管討論技術上執行困難點，獲予指導後再進行修正調整，短期內完成交付獲得團隊歸屬感及成就感。



            【過往作品】

            資策會:

            個人小專案：

            複合式餐飲的前端靜態頁面(RWD)、彈出視窗與輪播圖。下拉式選單與動畫，登入帳號邏輯。用Photoshop製作商品圖片。



            五人專案:

            我負責購物車頁面與聊天室運作設計以及資料庫基本規劃，前端用React 框架和antd套件設計頁面、React Router
            切換頁面並通過動態路由取得商品資訊，結帳時連接綠界科技物流API供使用者選擇送達的便利商店與門市，並與自己寫的API連接將資料送進資料庫。使用socket.io處理聊天室即時訊息傳遞。
        
        </div>
    </div>
</template>
